src/Documents/Доход/Доход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доход</name>
  <registerRecords>AccumulationRegister.ОборотыПлановыхОпераций</registerRecords>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКошельков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСтатей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПлановаяОперация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДохода</name>
      <type>
        <types>CatalogRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДохода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаСтатьи</name>
      <type>
        <types>CatalogRef.ЗначенияСубконтоАналитика</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦель</name>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналитикаДокумента</name>
    <comment>Аналитика, использованная в документе</comment>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактироватьВШапке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАналитикиВШапке</name>
      <type>
        <types>Characteristic.ВидыАналитик</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаДебетовая</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаКредитная</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыБюджетныхПоказателей/ТипыБюджетныхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБюджетныхПоказателей</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтатьиДоходов/СтатьиДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДоходов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОбменВалюты</name>
      <description>Обмен валюты</description>
    </items>
    <items>
      <name>ПрочиеДоходы</name>
      <description>Прочие доходы</description>
    </items>
    <items>
      <name>ИзменениеОстатка</name>
      <description>Изменение остатка</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПропускатьВводКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомментарийПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfAccounts/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>РазделыУчета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>100</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>СвободныеДеньги</name>
        <description>Свободные деньги</description>
        <code>100.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Накопления</name>
        <description>Накопления</description>
        <code>100.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>200</code>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>500</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ОсновныеСуммыДолгов</name>
        <description>Основные суммы долгов</description>
        <code>500.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПроцентыПоДолгам</name>
        <description>Проценты по долгам</description>
        <code>500.20</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>900</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗаголовокДляСубконтоПоДебету</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокДляСубконтоПоКредиту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.ЗначенияСубконтоАналитика</types>
    <types>CatalogRef.СтатьиРасходов</types>
    <types>CatalogRef.КошелькиИСчета</types>
    <types>CatalogRef.Долги</types>
    <types>CatalogRef.СтатьиДоходов</types>
    <types>CatalogRef.ФинансовыеЦели</types>
    <types>CatalogRef.Имущество</types>
  </type>
  <predefined>
    <items>
      <name>Аналитика</name>
      <description>Аналитика</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.ЗначенияСубконтоАналитика</types>
      </type>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Имущество</types>
      </type>
    </items>
    <items>
      <name>КошелькиИСчета</name>
      <description>Кошельки и счета</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </items>
    <items>
      <name>СтатьиДоходовРасходов</name>
      <description>Статьи доходов расходов</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
        <types>CatalogRef.СтатьиДоходов</types>
      </type>
    </items>
    <items>
      <name>ФинансовыеЦели</name>
      <description>Финансовые цели</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/Доход/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Формирует и записывает движения в регистры учета
//
//Параметры:
//	СсылкаНаДокумент       - ДокументСсылка.Доход - регистратор движений
//	ДвиженияДокумента      - КоллекцияДвижений или иная коллекция - наборы записей регистров учета
//	ДополнительныеСвойства - Структура - сордержит дополнительные свойства документа
//
Процедура СформироватьДвиженияДокумента(СсылкаНаДокумент, ДвиженияДокумента, ДополнительныеСвойства) Экспорт

	// Получаем таблицу для формирования движений
	Если ТипЗнч(ДополнительныеСвойства) <> Тип("Структура") Или Не ДополнительныеСвойства.Свойство("ТаблицыДокумента") Тогда
		ПроверитьДополнительныеСвойстваОперации(СсылкаНаДокумент, ДополнительныеСвойства);
	КонецЕсли;
	ТаблицыДокумента = ДополнительныеСвойства.ТаблицыДокумента;
	
	// Записываем движения в регистр бухгалтерии
	Для Каждого СтрокаДокумента Из ТаблицыДокумента.Доходы Цикл
	
		НоваяПроводка = ДвиженияДокумента.ЖурналОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, СтрокаДокумента);
		НоваяПроводка.СубконтоДт.Вставить(СтрокаДокумента.ВидСубконтоДт1, СтрокаДокумента.СубконтоДт1);
		Если СтрокаДокумента.ИспользоватьДляНакоплений Тогда
			НоваяПроводка.СубконтоДт.Вставить(СтрокаДокумента.ВидСубконтоДт2, СтрокаДокумента.СубконтоДт2);
		КонецЕсли; 
		НоваяПроводка.СубконтоКт.Вставить(СтрокаДокумента.ВидСубконтоКт1, СтрокаДокумента.СубконтоКт1);
		НоваяПроводка.СубконтоКт.Вставить(СтрокаДокумента.ВидСубконтоКт2, СтрокаДокумента.СубконтоКт2);
	
	КонецЦикла;
	
	// Записываем движения в регистр фактических оборотов бюджета
	Если ТаблицыДокумента.Свойство("ОборотыБюджета") Тогда
		ДвиженияДокумента.ФактическиеОборотыБюджета.Загрузить(ТаблицыДокумента.ОборотыБюджета);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру ДополнительныеСвойства значениями, необходимыми для дальнейшей обработки документа
//
//Параметры:
//	Операция               - ссылка или объект документа, зависит от контекста вызова этой процедуры
//	ДополнительныеСвойства - Структура или Неопределено - сордержит дополнительные свойства документа
//	ПроверятьТаблицыДокумента - Булево - заполнять ли таблицы для формирования движений
//
Процедура ПроверитьДополнительныеСвойстваОперации(Операция, ДополнительныеСвойства, ПроверятьТаблицыДокумента = Ложь) Экспорт

	// Выполняем проверку, одинаковую для всех документов
	ОбслуживаниеДокументов.ОбщаяПроверкаДополнительныхСвойствДокумента(Операция, ДополнительныеСвойства);
	
	Если НЕ ДополнительныеСвойства.Свойство("ВалютаОперации") ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеСвойства.ВалютаОперации) Тогда
		ДополнительныеСвойства.Вставить("ВалютаОперации", Операция.ВалютаОперации)
	КонецЕсли;
	
	Если ПроверятьТаблицыДокумента И Не ДополнительныеСвойства.Свойство("ТаблицыДокумента") Тогда
		ДополнительныеСвойства.Вставить("ТаблицыДокумента", ПолучитьВыборкиДляФормированияДвижений(Операция.Ссылка, ДополнительныеСвойства));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("ЭтоШаблон");
	Поля.Добавить("ОписаниеОперации");
	Поля.Добавить("СуммаОперации");
	Поля.Добавить("ВалютаОперации");
	Поля.Добавить("ПредставлениеКошельков");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Данные.ЭтоШаблон Тогда
		Представление = ДеньгиКлиентСервер.СокращенноеПредставление(Данные.ОписаниеОперации, 250, Ложь);
	Иначе
		Представление = НСтр("ru='Доход от'") + " " + Формат(Данные.Дата, "ДФ='дд.ММ.гггг (ЧЧ:мм)'")
				+ ": " + Формат(Данные.СуммаОперации, "ЧДЦ=2; ЧН=0.00") + " " + Данные.ВалютаОперации + " в " + ДеньгиКлиентСервер.СокращенноеПредставление(Строка(Данные.ПредставлениеКошельков));
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		
		РаботаСФормамиДокументов.ОпределитьФормуСпискаДляВыбора(Тип("ДокументСсылка.Доход"), Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВыборкиДляФормированияДвижений(СсылкаНаДокумент, ДополнительныеСвойства) 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",      СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ВалютаУчета", ДополнительныеСвойства.ВалютаУчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Регистратор,
	|	Шапка.Ссылка КАК Операция,
	|	Шапка.Дата КАК Период,
	|	Шапка.ЭтоШаблон КАК ЭтоШаблон,
	|	Шапка.Проведен,
	|	ЕСТЬNULL(ТабЧасть.Кошелек.ИспользоватьДляНакоплений, ЛОЖЬ) КАК ИспользоватьДляНакоплений,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТабЧасть.Кошелек.ИспользоватьДляНакоплений, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Накопления)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.СвободныеДеньги)
	|	КОНЕЦ КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.КошелькиИсчета) КАК ВидСубконтоДт1,
	|	ЕСТЬNULL(ТабЧасть.Кошелек, ЗНАЧЕНИЕ(Справочник.КошелькиИсчета.ПустаяСсылка)) КАК СубконтоДт1,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ФинансовыеЦели) КАК ВидСубконтоДт2,
	|	ЕСТЬNULL(ТабЧасть.ФинансоваяЦель, ЗНАЧЕНИЕ(Справочник.ФинансовыеЦели.ПустаяСсылка)) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Капитал) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СтатьиДоходовРасходов) КАК ВидСубконтоКт1,
	|	ЕСТЬNULL(ТабЧасть.СтатьяДохода, ЗНАЧЕНИЕ(Справочник.СтатьиДоходов.ПустаяСсылка)) КАК СубконтоКт1,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Аналитика) КАК ВидСубконтоКт2,
	|	ЕСТЬNULL(ТабЧасть.АналитикаСтатьи, НЕОПРЕДЕЛЕНО) КАК СубконтоКт2,
	|	ЕСТЬNULL(ТабЧасть.СуммаДохода, 0) КАК ВалютнаяСумма,
	|	ЕСТЬNULL(ТабЧасть.Кошелек.Валюта, &ВалютаУчета) КАК Валюта,
	|	ЕСТЬNULL(ТабЧасть.Комментарий, """") КАК Содержание,
	|	ЕСТЬNULL(ТабЧасть.Кошелек.ТипСчета, ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Наличность)) КАК ТипСчета
	|ИЗ
	|	Документ.Доход КАК Шапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Доход.Доходы КАК ТабЧасть
	|		ПО (ТабЧасть.Ссылка = Шапка.Ссылка)
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	ТабЧасть.НомерСтроки";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	СтруктураТаблиц         = Новый Структура("Доходы,ОбъектыОперации");
	
	// Таблица для формирования проводок
	СтруктураТаблиц.Доходы  = ПакетРезультатов[0].Выгрузить();
	
	// Таблицы для записи объектов операции и фактических оборотов бюджета
	ОбъектыОперации = ОбслуживаниеДокументов.НоваяТаблицаРегистраОбъектыОпераций();
	Если СтруктураТаблиц.Доходы.Количество() > 0 И 
			(СтруктураТаблиц.Доходы[0].ЭтоШаблон ИЛИ СтруктураТаблиц.Доходы[0].Проведен ИЛИ ДополнительныеСвойства.ЭтоПлановаяОперация) Тогда
		ОборотыБюджета = ОбслуживаниеДокументов.НоваяТаблицаРегистровОборотовБюджета();
	Иначе
		ОборотыБюджета = Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из СтруктураТаблиц.Доходы Цикл
		
		Если СтрокаДокумента.ИспользоватьДляНакоплений Тогда
			ФинЦель = ?(Не ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт2), Справочники.ФинансовыеЦели.ОбщиеНакопления, 
					СтрокаДокумента.СубконтоДт2);
		Иначе
			ФинЦель = Справочники.ФинансовыеЦели.ПустаяСсылка(); 
		КонецЕсли;
		
		// Списание
		ЗаписьСписания = ОбъектыОперации.Добавить();
		ЗаписьСписания.Дата              = СтрокаДокумента.Период;
		ЗаписьСписания.ЭтоШаблон         = СтрокаДокумента.ЭтоШаблон;
		ЗаписьСписания.Операция          = СтрокаДокумента.Регистратор;
		ЗаписьСписания.РазделУчета       = СтрокаДокумента.СчетДт;
		ЗаписьСписания.ПредметУчета      = СтрокаДокумента.СубконтоДт1;
		ЗаписьСписания.ФинансоваяЦель    = ФинЦель;
		ЗаписьСписания.ТипПоказателя     = Перечисления.ТипыБюджетныхПоказателей.Поступление;
		ЗаписьСписания.СуммаПоступления  = СтрокаДокумента.ВалютнаяСумма;
		ЗаписьСписания.Валюта            = СтрокаДокумента.Валюта;
		
		// Поступление
		ЗаписьПоступления = ОбъектыОперации.Добавить();
		ЗаписьПоступления.Дата              = СтрокаДокумента.Период;
		ЗаписьПоступления.ЭтоШаблон         = СтрокаДокумента.ЭтоШаблон;
		ЗаписьПоступления.Операция          = СтрокаДокумента.Регистратор;
		ЗаписьПоступления.РазделУчета       = СтрокаДокумента.СчетКт;
		ЗаписьПоступления.ПредметУчета      = СтрокаДокумента.СубконтоКт1;
		ЗаписьПоступления.ФинансоваяЦель    = ФинЦель; 
		ЗаписьПоступления.ТипПоказателя     = Перечисления.ТипыБюджетныхПоказателей.Поступление;
		ЗаписьПоступления.СуммаПоступления  = СтрокаДокумента.ВалютнаяСумма;
		ЗаписьПоступления.Валюта            = СтрокаДокумента.Валюта;
		
		Если ЗначениеЗаполнено(ФинЦель) Тогда
			ЗаписьНабора = ОбъектыОперации.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЗаписьСписания);
			ЗаписьНабора.ФинансоваяЦель    = Неопределено;
			
			ЗаписьНабора = ОбъектыОперации.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЗаписьПоступления);
			ЗаписьНабора.ФинансоваяЦель    = Неопределено;
		КонецЕсли;
		
		// Фактические обороты бюджета
		Если ОборотыБюджета <> Неопределено Тогда
			
			ЗаписьНабора = ОборотыБюджета.Добавить();
			ЗаписьНабора.Период           = СтрокаДокумента.Период;
			ЗаписьНабора.Регистратор      = СтрокаДокумента.Регистратор;
			ЗаписьНабора.РазделБюджета    = ФинЦель;
			ЗаписьНабора.СтатьяБюджета    = СтрокаДокумента.СубконтоКт1;
			ЗаписьНабора.ТипПоказателя    = Перечисления.ТипыБюджетныхПоказателей.Поступление;
			ЗаписьНабора.Валюта           = СтрокаДокумента.Валюта;
			ЗаписьНабора.Кошелек          = СтрокаДокумента.СубконтоДт1;
			ЗаписьНабора.Сумма            = СтрокаДокумента.ВалютнаяСумма;
			ЗаписьНабора.Комментарий      = СтрокаДокумента.Содержание;
			
			// Для кредитных карт записываем еще одну операцию факта: пополнение кредитной карты
			Если СтрокаДокумента.ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаКредитная Тогда
				ЗаписьНабора = ОборотыБюджета.Добавить();
				ЗаписьНабора.Период           = СтрокаДокумента.Период;
				ЗаписьНабора.Регистратор      = СтрокаДокумента.Регистратор;
				ЗаписьНабора.РазделБюджета    = ФинЦель;
				ЗаписьНабора.СтатьяБюджета    = СтрокаДокумента.СубконтоДт1;
				ЗаписьНабора.ТипПоказателя    = Перечисления.ТипыБюджетныхПоказателей.Списание;
				ЗаписьНабора.Валюта           = СтрокаДокумента.Валюта;
				ЗаписьНабора.Кошелек          = Неопределено;
				ЗаписьНабора.Сумма            = СтрокаДокумента.ВалютнаяСумма;
				ЗаписьНабора.Комментарий      = СтрокаДокумента.Содержание;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектыОперации.Свернуть("Дата, ЭтоШаблон, Операция, РазделУчета, ПредметУчета, ФинансоваяЦель, ТипПоказателя, Валюта", "СуммаПоступления, СуммаСписания");
	СтруктураТаблиц.Вставить("ОбъектыОперации", ОбъектыОперации);
	
	Если ОборотыБюджета <> Неопределено Тогда
		ОборотыБюджета.Свернуть("Период,Регистратор,РазделБюджета,СтатьяБюджета,ТипПоказателя,Валюта,Кошелек,Комментарий", "Сумма");
		СтруктураТаблиц.Вставить("ОборотыБюджета", ОборотыБюджета);
	КонецЕсли;
	
	Возврат СтруктураТаблиц;

КонецФункции

#КонецОбласти



#КонецЕсли
